electro-dan/PIC16F_TM1638_AquariumControl/PIC16F_TM1638_AquariumControl.c
#include <system.h>
#include <i2c_driver.h>
#include "PIC16F_TM1638_AquariumControl.h"

//Target PIC16F628A configuration word
#pragma DATA _CONFIG, _BODEN_OFF & _PWRTE_ON & _WDT_OFF & _CP_OFF & _XT_OSC // Brown out reset off, Power-up Timer on, Watchdog timer off, Code Protection off, XT oscillator

//Set clock frequency (for software delays) - 4MHz
#pragma CLOCK_FREQ	4000000

    
/*********************************************************************************************
  void oneWireBusReset()
  First part of the reset routine - drive the bus low for 500us
*********************************************************************************************/
void oneWireBusReset() {
    char isPresent;
    oneWireTris = 1; // start with high
    isPresent = 0;
    // Send the reset pulse - drive low for 500us
    oneWireBus = 0;      
    oneWireTris = 0;
    delay_10us(50);
    // Release line and wait 70us for PD Pulse
    oneWireTris = 1;
    delay_10us(7);
    // Now sample, if there is a sensor on the bus, the line should be low
    if (oneWireBus) {
        oneWireIsPresent = 0; // no devices
    }
    delay_10us(50);
}

/*********************************************************************************************
  void oneWireTxByte(char data)
  Transmits a single byte from the bus
*********************************************************************************************/
void oneWireTxByte(char cData) {
    char cTemp = 1;
    // Loop through the eight bits in the byte
    for (char i = 0; i < 8; i++) {
        // Send the LSB first

        // Drive the line low initially for 3us
        oneWireTris = 0;
        oneWireBus = 0;

        // Delay not needed for 4MHz PIC
        //delay_us(3); // Delay 3us
        
        if (cData & cTemp) {
            oneWireTris = 1; // Release the bus
        }
        
        delay_10us(5); // Delay 60us - 50us works fine with code delays
        oneWireTris = 1; // Release the bus
        
        // move the test bit
        cTemp <<= 1;
    }
}

/*********************************************************************************************
  void oneWireTxBytes(char data, char data2)
  Transmits a 2 bytes from the bus
*********************************************************************************************/
void oneWireTxBytes(char cData, char cData2) {
    // Reset first - done in main
    //oneWireBusReset();
    // Send first byte
    oneWireTxByte(cData);
    // Send second byte
    oneWireTxByte(cData2);
}

/*********************************************************************************************
  char oneWireRxByte()
  Receives a single byte from the bus
*********************************************************************************************/
char oneWireRxByte() {
    char cDataIn = 0;
    // Loop through the eight bits in the byte
    for(char i = 0; i < 8; i++) {
        // Bring bus low for 15us
        oneWireTris = 0;
        oneWireBus = 0;

        // Delay not needed for 4MHz PIC
        //delay_us(15); // Delay 15us

        // Release bus for 6us, this is enough time for the slave to respond
        oneWireTris = 1;
        delay_us(3); // Delay 6us
        
        // Shift data already received left
        cDataIn >>= 1;
        
        // Check the value of the onewire bus - set the MSB of cDataIn if so
        if (oneWireBus)
            cDataIn.7 = 1;

        // To finish time slot
        delay_10us(6); // 60us
    } 
    
    return cDataIn;
}

/*********************************************************************************************
  void at24c32WriteAll()
  Write multiple bytes
*********************************************************************************************/
void at24c32WriteAll() {
	// https://www.instructables.com/The-Most-Comprehensive-Guide-to-Programming-the-AT/
	i2c_start();
	i2c_write(at24c32Addr); // address + write
	// start at address 0
	i2c_write(0); // First word address (only 4 bits of the 12 bit byte address)
	i2c_write(0); // Second word address 
	// Write data bytes
	// We're only writing 18 bytes here, so no need to worry about row rollover after 32 bytes
	i2c_write(0x44); // To indicate AT24C32 has been written to
	i2c_write(gBcdWhiteOnMinute);
    i2c_write(gBcdWhiteOnHour);
    i2c_write(gBcdWhiteOffMinute);
    i2c_write(gBcdWhiteOffHour);
    i2c_write(gBcdBlueOnMinute);
    i2c_write(gBcdBlueOnHour);
    i2c_write(gBcdBlueOffMinute);
    i2c_write(gBcdBlueOffHour);
    i2c_write(gBcdFanOnTemp);
    i2c_write(gBcdFanOffTemp);
    i2c_write(gBcdHeaterOnTemp);
    i2c_write(gBcdHeaterOffTemp);
    i2c_write(gcHourMode);
    i2c_write(gBcdBlue2OnMinute);
    i2c_write(gBcdBlue2OnHour);
    i2c_write(gBcdBlue2OffMinute);
    i2c_write(gBcdBlue2OffHour);
	i2c_stop();
	delay_ms(10); // Write Cycle Time
}

/*********************************************************************************************
  void at24c32ReadAll()
  Read all bytes
*********************************************************************************************/
void at24c32ReadAll() {
	i2c_start();
	i2c_write(at24c32Addr); // address + write
	// start at address 0
	i2c_write(0); // First word address (only 4 bits of the 12 bit byte address)
	i2c_write(0); // Second word address 
	i2c_stop(); // Don't actually write a byte, just stop
	
	i2c_start();
	i2c_write(at24c32Addr + 1); // address + read
	char hasWritten = i2c_read(0); // ack
	if (hasWritten != 0x44) {
		i2c_read(1); // nack
	} else {
		gBcdWhiteOnMinute = i2c_read(0); // ack
		gBcdWhiteOnHour = i2c_read(0); // ack
		gBcdWhiteOffMinute = i2c_read(0); // ack
		gBcdWhiteOffHour = i2c_read(0); // ack
		gBcdBlueOnMinute = i2c_read(0); // ack
		gBcdBlueOnHour = i2c_read(0); // ack
		gBcdBlueOffMinute = i2c_read(0); // ack
		gBcdBlueOffHour = i2c_read(0); // ack
		gBcdFanOnTemp = i2c_read(0); // ack
		gBcdFanOffTemp = i2c_read(0); // ack
		gBcdHeaterOnTemp = i2c_read(0); // ack
		gBcdHeaterOffTemp = i2c_read(0); // ack
		gcHourMode = i2c_read(0); // ack
		gBcdBlue2OnMinute = i2c_read(0); // ack
		gBcdBlue2OnHour = i2c_read(0); // ack
		gBcdBlue2OffMinute = i2c_read(0); // ack
		gBcdBlue2OffHour = i2c_read(1); // nack
	}
	i2c_stop();
}


/*********************************************************************************************
  void ds3231Write(char ds3231Reg, char bWrite)
  Write one byte
*********************************************************************************************/
void ds3231Write(char ds3231Reg, char bWrite) {
	i2c_start();
	i2c_write(ds3231Addr); // address + write
	i2c_write(ds3231Reg); // start at address
	i2c_write(bWrite); // start at address
	i2c_stop();
}

/*********************************************************************************************
  void ds3231Init()
  Initialise the DS3231
*********************************************************************************************/
void ds3231Init() {
	/* control register 0Eh
    bit7 EOSC   Enable Oscillator (1 if oscillator must be stopped when on battery)
    bit6 BBSQW  Battery Backed Square Wave - 0 means square wave disabled when VCC falls below VPF (power fail voltage)
    bit5 CONV   Convert temperature (1 forces a conversion)
    bit4 RS2    Rate select - frequency of square wave output - NA for DS3231M
    bit3 RS1    Rate select - NA for DS3231M
    bit2 INTCN  Interrupt control (1 for use of the alarms and to disable square wave)
    bit1 A2IE   Alarm2 interrupt enable (1 to enable)
    bit0 A1IE   Alarm1 interrupt enable (1 to enable)
    */
	ds3231Write(0x0E, 0x00);
	/* Status Register 0Fh
    bit7 OSF     Oscillator stopped flag - clear oscillator stop flag at init
    bit3 EN32kHz Enable 32kHz Output - 0 for disabled
    bit2 BSY     Busy
    bit1 A2F     Alarm 2 Flag
    bit0 A1F     Alarm 1 Flag
    */
	ds3231Write(0x0F, 0x00);
}

/*********************************************************************************************
  void ds3231WriteDateTime()
  Write the date to the DS3231
*********************************************************************************************/
void ds3231WriteDateTime() {
	i2c_start();
	i2c_write(ds3231Addr); // address + write
	i2c_write(0); // start at address 0
	i2c_write(0); // seconds
	i2c_write(gBcdMinute); // minutes
	i2c_write(gBcdHour); // hours
	i2c_write(gDayOfWeek); // day of week
	i2c_write(gBcdDayOfMonth); // day of month
	i2c_write(gBcdMonth); // month + century
	i2c_write(gBcdYear); // year
	i2c_stop();
}

/*********************************************************************************************
  void ds3231ReadDateTime()
  Write the date to the DS3231
*********************************************************************************************/
void ds3231ReadDateTime() {
	i2c_start();
	i2c_write(ds3231Addr); // address + write
	i2c_write(0); // start at address 0
	i2c_stop();
	
