electro-dan/PIC16F_TM1638_AquariumControl/PIC16F_TM1638_AquariumControl.c
	i2c_start();
	i2c_write(ds3231Addr + 1); // address + read
	gBcdSecond = i2c_read(0); // ack
	gBcdMinute = i2c_read(0); // ack
	gBcdHour = i2c_read(0); // ack
	gDayOfWeek = i2c_read(0); // ack
	gBcdDayOfMonth = i2c_read(0); // ack
	gBcdMonth = i2c_read(0); // ack
	gBcdYear = i2c_read(1); // nack
	i2c_stop();
}

/*********************************************************************************************
  char ds3231ReadRegister(char cRegAddress)
  Read one byte from a given DS3231 register address
*********************************************************************************************/
char ds3231ReadRegister(char cRegAddress) {
	char cStatus;
	i2c_start();
	i2c_write(ds3231Addr); // address + write
	i2c_write(cRegAddress); // start at requested address
	i2c_stop();
	
	i2c_start();
	i2c_write(ds3231Addr + 1); // address + read
	cStatus = i2c_read(1); // read the byte, then nack
    i2c_stop();
    return cStatus;
}

/*********************************************************************************************
  void tm1638ByteWrite(char bWrite)
  Write one byte
*********************************************************************************************/
void tm1638ByteWrite(char bWrite) {
    for (char i = 0; i < 8; i++) {
        tm1638dio = (bWrite & 0x01);
        tm1638clk = 0;
        bWrite = (bWrite >> 1);
        tm1638clk = 1;
    }
}

/*********************************************************************************************
  void tm1638DisplayOn()
  Turns the display on, with defined brightness
*********************************************************************************************/
void tm1638DisplayOn() {
    // Write 0x8F [10001000] to set display ON with pulse width 14/16
    tm1638strobe = 0;
    tm1638ByteWrite(0x88);
    tm1638strobe = 1;
}

/*********************************************************************************************
  void nibbleTo7Seg(char iNibble)
  Convert a single nibble into the 7-segment representation (two digits)
  7-segment digit to be written will be iPrintStartDigit, which is auto-incremented after
  If iPrintDotDigit matches, the dot on the display digit will be added
*********************************************************************************************/
void nibbleTo7Seg(char bNibble) {
	char s7SegDisplay = tm1638DisplayNumtoSeg[bNibble & 0x0F];
	if (iPrintStartDigit == iPrintDotDigit)
        s7SegDisplay |= tm1638Dot;
    tm1638Data[iPrintStartDigit] = s7SegDisplay;
    iPrintStartDigit++;
}

/*********************************************************************************************
  void bcdTo7Seg(char iBcdIn)
  Convert a single bcd byte into the 7-segment representation (two digits)
*********************************************************************************************/
void bcdTo7Seg(char iBcdIn) {
    nibbleTo7Seg(iBcdIn >> 4);
    nibbleTo7Seg(iBcdIn);
}

/*********************************************************************************************
  void tm1638UpdateDisplay()
  Publish the tm1638Data and tm1638LEDs arrays to the display
*********************************************************************************************/
void tm1638UpdateDisplay() {
    
    // Display current temperature unless set, trigger or alt display mode is active
    if ((gcDisplayMode == 2) | gcSetMode | gcTriggerMode) {
        if (gcSetMode == 1) {
            iDigitToFlash = 3;
            // Display year
            // Start printing from digit 0
            iPrintStartDigit = 0;
            iPrintDotDigit = 3;
            bcdTo7Seg(0x20); // Display 20 in digits 0 and 1 (no dot)
            bcdTo7Seg(gBcdYear); // Display year in digits 2 and 3 (+dot on 3)
        } else if (gcSetMode == 4) {
            iDigitToFlash = 3;
            // Display day of week
            tm1638Data[0] = 0x5E; // d
            tm1638Data[1] = 0x5F; // a
            tm1638Data[2] = 0x6E; // y
            tm1638Data[3] = tm1638DisplayNumtoSeg[gDayOfWeek] + tm1638Dot;
        } else if (gcSetMode == 5) {
            iDigitToFlash = 1;
            // Display day of week
            if (gcHourMode) {
				tm1638Data[0] = 0x06; // 1
				tm1638Data[1] = 0x5B; // 2
			} else {
				tm1638Data[0] = 0x5B; // 2
				tm1638Data[1] = 0x66; // 4
			}
            tm1638Data[2] = 0x74; // h
            tm1638Data[3] = 0x00; // blank
        } else if (gcTriggerMode) {
            iPrintDotDigit = 5;
            switch (gcTriggerMode) {
                case 1:
                    // White LED on hour
                    tm1638Data[0] = 0x38; // L
                    tm1638Data[1] = 0x00; // space
                    tm1638Data[2] = 0x3F; // O
                    tm1638Data[3] = 0x54; // n
                    iDigitToFlash = 5;
                    // Start printing from digit 4
                    iPrintStartDigit = 4;
                    bcdTo7Seg(gBcdWhiteOnHour); // Display hour in digits 4 and 5 (dot on 5)
                    bcdTo7Seg(gBcdWhiteOnMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 2:
                    // White LED on minute
                    iDigitToFlash = 7;
                    // Start printing from digit 6
                    iPrintStartDigit = 6;
                    bcdTo7Seg(gBcdWhiteOnMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 3:
                    // White LED off hour
                    tm1638Data[3] = 0x71; // F
                    iDigitToFlash = 5;
                    // Start printing from digit 4
                    iPrintStartDigit = 4;
                    bcdTo7Seg(gBcdWhiteOffHour); 
                    bcdTo7Seg(gBcdWhiteOffMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 4:
                    // White LED off minute
                    iDigitToFlash = 7;
                    // Start printing from digit 6
                    iPrintStartDigit = 6;
                    bcdTo7Seg(gBcdWhiteOffMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 5:
                    // 1st Blue LED on hour
                    tm1638Data[0] = 0x7C; // b
                    tm1638Data[1] = 0x06; // 1
                    //tm1638Data[2] = 0x3F; // O
                    tm1638Data[3] = 0x54; // n
                    iDigitToFlash = 5;
                    // Start printing from digit 4
                    iPrintStartDigit = 4;
                    bcdTo7Seg(gBcdBlueOnHour); // Display hour in digits 4 and 5 (dot on 5)
                    bcdTo7Seg(gBcdBlueOnMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 6:
                    // 1st Blue LED on minute
                    iDigitToFlash = 7;
                    // Start printing from digit 6
                    iPrintStartDigit = 6;
                    bcdTo7Seg(gBcdBlueOnMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 7:
                    // 1st Blue LED off hour
                    tm1638Data[3] = 0x71; // F
                    iDigitToFlash = 5;
                    // Start printing from digit 4
                    iPrintStartDigit = 4;
                    bcdTo7Seg(gBcdBlueOffHour); // Display hour in digits 4 and 5 (dot on 5)
                    bcdTo7Seg(gBcdBlueOffMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 8:
                    // 1st Blue LED off minute
                    iDigitToFlash = 7;
                    // Start printing from digit 6
                    iPrintStartDigit = 6;
                    bcdTo7Seg(gBcdBlueOffMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 9:
                    // 2nd Blue LED on hour
                    tm1638Data[0] = 0x7C; // b
                    tm1638Data[1] = 0x5B; // 2
                    //tm1638Data[2] = 0x3F; // O
                    tm1638Data[3] = 0x54; // n
                    iDigitToFlash = 5;
                    // Start printing from digit 4
                    iPrintStartDigit = 4;
                    bcdTo7Seg(gBcdBlue2OnHour); // Display hour in digits 4 and 5 (dot on 5)
                    bcdTo7Seg(gBcdBlue2OnMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 10:
                    // 2nd Blue LED on minute
                    iDigitToFlash = 7;
                    // Start printing from digit 6
                    iPrintStartDigit = 6;
                    bcdTo7Seg(gBcdBlueOnMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 11:
                    // 2nd Blue LED off hour
                    tm1638Data[3] = 0x71; // F
                    iDigitToFlash = 5;
                    // Start printing from digit 4
                    iPrintStartDigit = 4;
                    bcdTo7Seg(gBcdBlue2OffHour); // Display hour in digits 4 and 5 (dot on 5)
                    bcdTo7Seg(gBcdBlue2OffMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 12:
                    // 2nd Blue LED off minute
                    iDigitToFlash = 7;
                    // Start printing from digit 6
                    iPrintStartDigit = 6;
                    bcdTo7Seg(gBcdBlue2OffMinute); // Display minute in digits 6 and 7 (no dot)
                    break;
                case 13:
                    // Fan on temperature
                    tm1638Data[0] = 0x71; // F
                    tm1638Data[1] = 0x5F; // a
                    tm1638Data[2] = 0x54; // n
                    tm1638Data[3] = 0x00; // space
                    tm1638Data[4] = 0x3F; // O
                    tm1638Data[5] = 0x54; // n
                    iDigitToFlash = 7;
                    // Start printing from digit 6
                    iPrintStartDigit = 6;
                    bcdTo7Seg(gBcdFanOnTemp); // Display celcius in digits 6 and 7 (no dot)
                    break;
                case 14:
                    // Fan off temperature
                    tm1638Data[5] = 0x71; // f
                    // Start printing from digit 6
                    iPrintStartDigit = 6;
                    bcdTo7Seg(gBcdFanOffTemp); // Display celcius in digits 6 and 7 (no dot)
                    break;
                case 15:
                    // Heater on temperature
                    tm1638Data[0] = 0x76; // H
                    tm1638Data[1] = 0x7B; // e
                    tm1638Data[2] = 0x5F; // a
                    tm1638Data[3] = 0x78; // t
                    tm1638Data[4] = 0x3F; // O
                    tm1638Data[5] = 0x54; // n
                    iDigitToFlash = 7;
                    // Start printing from digit 6
                    iPrintStartDigit = 6;
                    bcdTo7Seg(gBcdHeaterOnTemp); // Display celcius in digits 6 and 7 (no dot)
                    break;
                case 16:
                    // Heater off temperature
                    tm1638Data[5] = 0x71; // f
                    // Start printing from digit 6
                    iPrintStartDigit = 6;
                    bcdTo7Seg(gBcdHeaterOffTemp); // Display celcius in digits 6 and 7 (no dot)
                    break;
            }
        } else {
            switch (gcSetMode) {
                case 2:
                    iDigitToFlash = 3;
                    break;
                case 3:
                    iDigitToFlash = 1;
                    break;
                case 6:
                    iDigitToFlash = 5;
                    break;
                case 7:
                    iDigitToFlash = 7;
                    break;
                default:
                    iDigitToFlash = 8;
            }
            // Display date DD.MM
            iPrintStartDigit = 0;
            iPrintDotDigit = 1;
            bcdTo7Seg(gBcdDayOfMonth); // Display day of month in digits 0 and 1 (+dot on 1)
            iPrintDotDigit = 3;
            bcdTo7Seg(gBcdMonth); // Display month in digits 2 and 3 (+dot on 3)
        }
    } else {
        iDigitToFlash = 8; // No flashing digit in this mode
        // translate DS3231 temperature to digit values
        iPrintDotDigit = 1;
        if (gcDisplayMode == 1) // no dot on the first two digits for fahrenheit
			iPrintDotDigit = 2;
        // For -10 or below, shift digits right
        if (gbDS3231IsMinus && (giDS3231ValueBCD & 0xF000)) {
            giDS3231ValueBCD >>= 4;
            iPrintDotDigit = 2;
        }
        // Display current temperature in digits 0 to 3 (+dot on digit 1 and 3)
        iPrintStartDigit = 0;
        bcdTo7Seg(giDS3231ValueBCD >> 8);
        bcdTo7Seg(giDS3231ValueBCD);
        // Also display dot on 4th digit (always)
		//tm1638Data[3] = tm1638Data[3] + tm1638Dot;
		tm1638Data[3] |= tm1638Dot;

        // left fill zero with blank
        if (tm1638Data[0] == 0x3F)
            tm1638Data[0] = 0;
        // If minus, overwrite left most digit with minus sign
        if (gbDS3231IsMinus)
            tm1638Data[0] = 0x40;
    }

