electro-dan/PIC16F_TM1638_AquariumControl/PIC16F_TM1638_AquariumControl.c
    // HH.MM in last 4 digits of TM1638
    if (!gcTriggerMode) {
        iPrintStartDigit = 4;
        // Flash dot every second
        if (gBcdSecond.0)
			iPrintDotDigit = 5;
		else
			iPrintDotDigit = 8;
        char cBcdHourDisp = gBcdHour;
        if (gcHourMode && (gBcdHour > 0x12)) {
			// convert to 12h
			cBcdHourDisp -= 0x12;
			// For 8 and 9pm, take off another 6
			if ((cBcdHourDisp & 0x0F) > 7)
                cBcdHourDisp -= 6;
        }
        if (gcHourMode && gBcdHour == 0) {
			cBcdHourDisp = 0x12; // 12am
        }
        bcdTo7Seg(cBcdHourDisp); // Display hour in digits 4 and 5 (dot on 5)
        // left fill zero with blank
        if (tm1638Data[4] == 0x3F)
            tm1638Data[4] = 0;
        if (gcHourMode && (gBcdHour > 0x11)) {
			// PM dot
			iPrintDotDigit = 7;
        }
        bcdTo7Seg(gBcdMinute); // Display minute in digits 6 and 7 (no dot)
    }

    // Light LED for set mode
    char cCompareSetMode = gcSetMode;
    for (char i = 2; i < 8; i++) {
        if (i == cCompareSetMode)
            tm1638LEDs[i] = 1;
        else
            tm1638LEDs[i] = 0;
    }
    tm1638LEDs[0] = HEATER;
    tm1638LEDs[1] = FAN;

    // Write 0x40 [01000000] (table 5.1) to indicate command to display data - [Write data to display register]
    tm1638strobe = 0;
    tm1638ByteWrite(tm1638ByteSetData);
    tm1638strobe = 1;
    
    tm1638strobe = 0;
    // Specify the display address 0xC0 [11000000] (table 5.2) [Display address 00H] then write out all 16 bytes
    tm1638ByteWrite(tm1638ByteSetAddr);
    for (char i = 0; i < tm1638MaxDigits; i++) {
        // display digit first
        if (iFlashDigitOff.0 && (i == iDigitToFlash))
            tm1638ByteWrite(0);
        else
            tm1638ByteWrite(tm1638Data[i]);
        // then LED
        tm1638ByteWrite(tm1638LEDs[i]);
    }
    tm1638strobe = 1;
}

/*********************************************************************************************
  void tm1638ReadKeys()
  Reads the keys status into tm1638Keys
*********************************************************************************************/
void tm1638ReadKeys() {
    // Write 0x42 [01000010] to indicate command to read data
    tm1638strobe = 0;
    tm1638ByteWrite(tm1638ByteReadData);
    
    tm1638dioTris = 1; // Set data pin to input
    char tm1638KeysTemp = 32;
    // Read 4 bytes
    for (char i = 0; i < 32; i++) {
        tm1638KeysTemp--;
        tm1638clk = 0;
        delay_us(1);
        if(tm1638dio)
            tm1638KeysTemp <<= 1;
        tm1638clk = 1;
    }
    tm1638dioTris = 0; // Set data pin to output
    tm1638strobe = 1;

    tm1638Keys = tm1638KeysTemp;
    /*
    1F = 0001 1111
	17 = 0001 0111
	0F = 0000 1111
	07 = 0000 0111
	1B = 0001 1011
	13 = 0001 0011
	0B = 0000 1011
	03 = 0000 0111
	*/
}

/*********************************************************************************************
  int intToBcd(int iValue)
  Used to split the 16 bit integer into bcd parts (max 9999)
*********************************************************************************************/
int intToBcd(int iValue) {
    int iBcdOut = 0;
    // Split via loops = less program memory needed, may be slower executing
    // https://electronics.stackexchange.com/questions/158563/how-to-split-a-floating-point-number-into-individual-digits
    iBcdOut = 0;

    // incrementing variables for each digit
    // determine to thousands digit
    while (iValue >= 1000) {
        iValue -= 1000;
        // each time we take off 1000, the digit is incremented
        iBcdOut += 0x1000;
    }

    // determine to hundreds digit
    while (iValue >= 100) {
        iValue -= 100;
        // each time we take off 100, the digit is incremented
        iBcdOut += 0x100;
    }

    // determine to tens digit
    while (iValue >= 10) {
        iValue -= 10;
        // each time we take off 10, the left most digit is incremented
        iBcdOut += 0x10;
    }

    // the last digit is what's left on iValue
    iBcdOut += iValue;
}

/*********************************************************************************************
  void convertTemp()
  Used to convert the ds18b20 temperature to display values
*********************************************************************************************/
void convertTemp() {
    // convert both bytes to a 16bit int - e.g. 0000 0001 0100 0110 (1 and 70, gives 326)
    signed int iTemp = (cTempH << 8) | cTempL;
    signed int iTemp2 = iTemp;
    
    // this gets celcius * 100 - https://www.phanderson.com/PIC/PICC/sourceboost/ds18b20_1.html
    // Celcius value is always required for triggering
	gbDS3231IsMinus = (iTemp2 < 0);
	if (gbDS3231IsMinus) {
		iTemp2 = ~iTemp2 + 1;
	}
    int iValueC = (6 * iTemp2) + (iTemp2 / 4);
    // Split the temperature reading into digits
    giDS3231ValueBCD = intToBcd(iValueC);
    // Truncated value for triggering heater/fans
    giDS3231ValueTruncCBCD = giDS3231ValueBCD >> 8;
    
    if (gcDisplayMode == 1) {
		// -17.8125 (-285/65251) results in minus fahrenheit (-0.125), -17.75 (-284/65250) results in positive fahrenheit (1)
        // this gets Fahrenheit * 10 - https://www.electro-tech-online.com/threads/temperature-sensor-ds18b20-display-fahrenhiet.117377/
        iTemp2 = ((iTemp + 4) / 8) + iTemp + 320;
        // convert to absolute value
        gbDS3231IsMinus = (iTemp2 < 0);
        if (gbDS3231IsMinus) {
            iTemp2 = ~iTemp2 + 1;
        }
        // Split the temperature reading into digits
        giDS3231ValueBCD = intToBcd(iTemp2);
	}
}

/*********************************************************************************************
  void startTemp()
  Sends the Convert T [44h] function command to the ds18b20
*********************************************************************************************/
void startTemp() {
    // CC indicates to skip rom - addressing all devices (there is only one)
    // 44 is the convert function
    oneWireTxBytes(0xCC, 0x44);
}

/*********************************************************************************************
  void startTemp()
  Sends the Read Scratchpad [BEh] function command to the ds18b20
*********************************************************************************************/
void readTemp() {
    // CC indicates to skip rom - addressing all devices (there is only one)
    // BE indicates to read scratchpad
    oneWireTxBytes(0xCC, 0xBE);
    // Now get the temperature from the scratchpad
    // This is in the first two bytes - so get those only and ignore the rest
    cTempL = oneWireRxByte();
    cTempH = oneWireRxByte();
}

/*********************************************************************************************
  char bcdAdjust(char bcd, char bcdMax, char bcdMin)
  Increment or Decrement a BCD variable for sending to the DS3231, within a given range
  Must set iBcdAdjustment first
*********************************************************************************************/
char bcdAdjust(char bcd, char bcdMax, char bcdMin) {
    if (iBcdAdjustment == 1) {
        // Increment
        // if at maximum, reset to minimum
        if (bcd == bcdMax)
            bcd = bcdMin;
        else if ((bcd & 0x0F) == 9)
            bcd += 0x07; // add 0x10 (16), minus 9
        else
            bcd++;
    } else {
        // Decrement
        // if at minimum, reset to maximum
        if (bcd == bcdMin)
            bcd = bcdMax;
        else if ((bcd & 0x0F) == 0)
            bcd -= 0x07; // minus 0x10 (16), add 9
        else
            bcd--;
    }
    return bcd;
}

/*********************************************************************************************
  void adjustDateTime()
  Increment or Decrement a BCD variable for sending to the DS3231, within a given range
  Must set iBcdAdjustment first
*********************************************************************************************/
void adjustDateTime() {
    switch (gcSetMode) {
        case 1:
            // Setting year
            gBcdYear = bcdAdjust(gBcdYear, 0x99, 0x00);
            break;
        case 2:
            // Setting month
            gBcdMonth = bcdAdjust(gBcdMonth, 0x12, 0x01);
            break;
        case 3:
            // Setting day of month
            char iMonth = gBcdMonth;
            if (iMonth & 0xF0)
                iMonth += (gBcdMonth >> 4);
            iMonth--; // Make 0 to 11 index based
            char bcdMaxDay = gDaysInMonth[iMonth]; 
            // If February, adjust max days for leap years
            if (iMonth == 1) {
                // See if the 24 leap years since 2000 match the current year
                for (char i = 0; i < 24; i++) {
                    if (gLeapYears[i] == gBcdYear) {
                        bcdMaxDay = 0x29;
                        break;
                    }
                }
            }
            gBcdDayOfMonth = bcdAdjust(gBcdDayOfMonth, bcdMaxDay, 0x01);
            break;
        case 4:
            // Setting day of week
            gDayOfWeek = bcdAdjust(gDayOfWeek, 0x07, 0x01);
            break;
        case 5:
            // Setting 12h/24h
            gcHourMode++;
            if (gcHourMode > 2)
				gcHourMode = 0;
            break;
        case 6:
            // Setting hour
            gBcdHour = bcdAdjust(gBcdHour, 0x23, 0x00);
            break;
        case 7:
            // Setting minute
            gBcdMinute = bcdAdjust(gBcdMinute, 0x59, 0x00);
            break;
    }
}

/*********************************************************************************************
  void adjustTrigger()
  Increment or Decrement a trigger time or temperate
  Must set iBcdAdjustment first
*********************************************************************************************/
void adjustTrigger() {
    switch (gcTriggerMode) {
        case 1:
            // White LED on hour
            gBcdWhiteOnHour = bcdAdjust(gBcdWhiteOnHour, 0x23, 0x00);
            break;
        case 2:
            // White LED on minute
            gBcdWhiteOnMinute = bcdAdjust(gBcdWhiteOnMinute, 0x59, 0x00);
            break;
        case 3:
            // White LED off hour
            gBcdWhiteOffHour = bcdAdjust(gBcdWhiteOffHour, 0x23, 0x00);
            break;
        case 4:
            // White LED off minute
            gBcdWhiteOffMinute = bcdAdjust(gBcdWhiteOffMinute, 0x59, 0x00);
            break;
        case 5:
            // Blue LED on hour
            gBcdBlueOnHour = bcdAdjust(gBcdBlueOnHour, 0x23, 0x00);
            break;
        case 6:
            // Blue LED on minute
            gBcdBlueOnMinute = bcdAdjust(gBcdBlueOnMinute, 0x59, 0x00);
            break;
        case 7:
            // Blue LED off hour
            gBcdBlueOffHour = bcdAdjust(gBcdBlueOffHour, 0x23, 0x00);
            break;
        case 8:
            // Blue LED off minute
            gBcdBlueOffMinute = bcdAdjust(gBcdBlueOffMinute, 0x59, 0x00);
            break;
        case 9:
            // Blue LED on hour
            gBcdBlue2OnHour = bcdAdjust(gBcdBlue2OnHour, 0x23, 0x00);
            break;
        case 10:
            // Blue LED on minute
            gBcdBlue2OnMinute = bcdAdjust(gBcdBlue2OnMinute, 0x59, 0x00);
            break;
        case 11:
            // Blue LED off hour
            gBcdBlue2OffHour = bcdAdjust(gBcdBlue2OffHour, 0x23, 0x00);
            break;
        case 12:
            // Blue LED off minute
            gBcdBlue2OffMinute = bcdAdjust(gBcdBlue2OffMinute, 0x59, 0x00);
            break;
        case 13:
            // Fan on temp - between 20 and 40 degrees C
            gBcdFanOnTemp = bcdAdjust(gBcdFanOnTemp, 0x40, 0x20);
            break;
        case 14:
            // Fan off temp - off must be lower than on, min 20 degrees C
            if (gBcdFanOffTemp > gBcdFanOnTemp)
				gBcdFanOffTemp = gBcdFanOnTemp;
            gBcdFanOffTemp = bcdAdjust(gBcdFanOffTemp, gBcdFanOnTemp, 0x20);
            break;
        case 15:
            // Heater on temp - between 0 and 40 degrees C
            gBcdHeaterOnTemp = bcdAdjust(gBcdHeaterOnTemp, 0x40, 0);
            break;
        case 16:
            // Heater off temp - off must be equal or higher than on - max 40 degrees C
            if (gBcdHeaterOffTemp < gBcdHeaterOnTemp)
				gBcdHeaterOffTemp = gBcdHeaterOnTemp;
            gBcdHeaterOffTemp = bcdAdjust(gBcdHeaterOffTemp, 0x40, gBcdHeaterOnTemp);
            break;
    }
}

/*********************************************************************************************
  void processKeys()
  Action a key press
*********************************************************************************************/
void processKeys() {
    switch (tm1638Keys) {
        case 0x1F:
            // Toggle white light on/off
            WHITE_LED = !WHITE_LED;
            break;
        case 0x17:
            // Toggle blue light on/off
            BLUE_LED = !BLUE_LED;
            break;
        case 0x0F:
            // Toggle fan on/off
            gbFanOn = !gbFanOn;
            break;
        case 0x07:
            // Exit other modes
            gcSetMode = 0;
            gcTriggerMode = 0;
            // Display temp C/temp F/date
            gcDisplayMode++;
            if (gcDisplayMode > 3)
                gcDisplayMode = 0;
            convertTemp(); // force conversion (no read)
            break;
        case 0x1B:
            // Exit other modes
            gcTriggerMode = 0;
            // Adjust set mode
            gcSetMode++;
            if (gcSetMode > 7) {
                ds3231WriteDateTime();
                gcSetMode = 0;
            }
            break;
        case 0x13:
            // Adjust down
            iBcdAdjustment = 0;
            if (gcSetMode) {
                adjustDateTime();
            } else if (gcTriggerMode) {
                adjustTrigger();
            }
            break;
        case 0x0B:
            iBcdAdjustment = 1;
            // Adjust up
            if (gcSetMode) {
                adjustDateTime();
            } else if (gcTriggerMode) {
                adjustTrigger();
            }
            break;
        case 0x03:
            // Exit set mode
            gcSetMode = 0;
            // Adjust timer mode
            gcTriggerMode++;
            if (gcTriggerMode > 12) {
                gcTriggerMode = 0;
                at24c32WriteAll(); // Exiting trigger mode, save the new triggers to EEPROM chip
            }
            break;
    }
}

/*********************************************************************************************
  void interrupt()
  Interrupt handler
*********************************************************************************************/
void interrupt() {
    // Interrupt on timer0 - flash digit delay
    if (intcon.T0IF) {
        iTimer0Counts++;
        tmr0 = TMR0PRELOAD;
        cTask.TASK_TIMER0 = 1;
        // Clear interrupt flag
        intcon.T0IF = 0; 
    }
    // Handle timer1 interrupt - delay counter from DS3231
    if (pir1.TMR1IF) {
        tmr1h = TMR1HV;      // preset for timer1 MSB register
        tmr1l = TMR1LV;      // preset for timer1 LSB register

